In [1]:
import pandas as pd

In [2]:
import pandas as pd

In [3]:
obj = pd.Series([4,10,-5,15])
obj

0     4
1    10
2    -5
3    15
dtype: int64

In [4]:
obj%2==0

0     True
1     True
2    False
3    False
dtype: bool

In [5]:
obj+5, obj+2

(0     9
 1    15
 2     0
 3    20
 dtype: int64,
 0     6
 1    12
 2    -3
 3    17
 dtype: int64)

In [6]:
obj[obj%2==0]

0     4
1    10
dtype: int64

In [7]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000,'Utah': 5000}
obj3 = pd.Series(sdata)
print(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [8]:
list1 = [['Alice',23,3.5,10],['Bob',24,3.4,6],['Charlie',22,3.9,8]]
df = pd.DataFrame(list1)
df.columns = ['name','age','cgpa','hoursStudied']
print(df.head())

      name  age  cgpa  hoursStudied
0    Alice   23   3.5            10
1      Bob   24   3.4             6
2  Charlie   22   3.9             8

In [9]:
dict1 = {'id':[1,2,3],'name':['alice','bob','charlie'],'age':[20, 25, 32]}
df1 = pd.DataFrame(dict1)
print(df1)

   id     name  age
0   1    alice   20
1   2      bob   25
2   3  charlie   32

In [10]:
df2 = pd.read_csv('sample_data_1.csv', header = None)
df2

   0            1         2    3
0  1      Alabama   4779736  5.7
1  2       Alaska    710231  5.6
2  3      Arizona   6392017  4.7
3  4     Arkansas   2915918  5.6
4  5   California  37253956  4.4
5  6     Colorado   5029196  2.8
6  7  Connecticut   3574097  2.4
7  8     Delaware    897934  5.8

In [11]:
df2 = pd.read_csv('sample_data_1.csv', header = None)
df2.columns=['id','state','population','murder_rate']
print(df2)
df2.head() # displays first 5 rows
df2.tail() # displays last 5 rows
df2.count() # displays number of values for each column

   id        state  population  murder_rate
0   1      Alabama     4779736          5.7
1   2       Alaska      710231          5.6
2   3      Arizona     6392017          4.7
3   4     Arkansas     2915918          5.6
4   5   California    37253956          4.4
5   6     Colorado     5029196          2.8
6   7  Connecticut     3574097          2.4
7   8     Delaware      897934          5.8

id             8
state          8
population     8
murder_rate    8
dtype: int64

In [12]:
print(df2.iloc[5][3])
print(df2.loc[1]['state'])

2.8
Alaska

In [15]:
df3=df2[['state','population']]
print(df3)

         state  population
0      Alabama     4779736
1       Alaska      710231
2      Arizona     6392017
3     Arkansas     2915918
4   California    37253956
5     Colorado     5029196
6  Connecticut     3574097
7     Delaware      897934

In [16]:
df4 = df2.loc[1:2]
print(df4)
df5 = df1.iloc[1:3]
print(df5)

   id    state  population  murder_rate
1   2   Alaska      710231          5.6
2   3  Arizona     6392017          4.7
   id     name  age
1   2      bob   25
2   3  charlie   32

In [17]:
df4 = df1.loc[1:2,['name','age']]
print(df4)
df5 = df1.iloc[1:3,[0,1]]
print(df5)

      name  age
1      bob   25
2  charlie   32
   id     name
1   2      bob
2   3  charlie

In [18]:
list1 = [['Alice',23,3.5,10],['Bob',24,3.4,6],['Charlie',22,3.9,8]]
df = pd.DataFrame(list1)
df.columns = ['name','age','cgpa','hoursStudied']

In [19]:
list2 = [['Don',21,2.5,2],['Elton',25,2.75,4]]
df11 = pd.DataFrame(list2)
df11.columns = ['name','age','cgpa','hoursStudied']

In [20]:
df12 = df.append(df11, ignore_index=True)
print(df12)

      name  age  cgpa  hoursStudied
0    Alice   23  3.50            10
1      Bob   24  3.40             6
2  Charlie   22  3.90             8
3      Don   21  2.50             2
4    Elton   25  2.75             4

In [21]:
df12.drop([0,1], inplace=True)
df12.drop(['cgpa'], axis=1, inplace=True)

In [22]:
new_cols = ['n','a','hs']
df12.columns=new_cols
print(df12)

         n   a  hs
2  Charlie  22   8
3      Don  21   2
4    Elton  25   4

In [24]:
cgpa_greater_than_three_point_five1 = df[df['cgpa'] > 3.5]
cgpa_greater_than_three_point_five2 = df.loc[df['cgpa'] > 3.5]
cgpa_greater_than_three_point_five3 = df.query('cgpa > 3.5')

print(cgpa_greater_than_three_point_five1)
print(cgpa_greater_than_three_point_five2)
print(cgpa_greater_than_three_point_five3)
df1.sort_values(by='age',ascending=False)

      name  age  cgpa  hoursStudied
2  Charlie   22   3.9             8
      name  age  cgpa  hoursStudied
2  Charlie   22   3.9             8
      name  age  cgpa  hoursStudied
2  Charlie   22   3.9             8

   id     name  age
2   3  charlie   32
1   2      bob   25
0   1    alice   20